emacs/Emacs.org
#+title: Emacs Configuration
#+author: Tommaso Rossi
#+property: header-args:emacs-lisp :tangle .emacs.d/init.el :mkdirp yes

Literate configuration for GNU Emacs.

Main features:
- Optimization of startup times with careful lazy loading.
- Reproducible builds with =straight.el=.
- Completion framework including completions at point and minibuffer completions
  with incremental narrowing, fuzzy matching of results and frequency-recency based ordering
  of completion candidates.
- Enhancements of Emacs terminals, with special attention to =eshell=.
- Non-intrusive vim-like (=evil=) keybindings.  Keybindings in this configuration are the Emacs
  defaults, eccept for the ones set by =evil= and =evil-collection=.  No further customization
  is performed for ensuring understandability.
- Development with LSP mode where feasible.
- Configuration of some frontends for external applications to ensure an immersive Emacs experience.
- Optional configuration of =EXWM=, the Emacs window manager for Xorg (see =Desktop.org=).

Note: sometimes I found clearer to read directly the tangled source instead of the Org file.
That's why comments are tangled in source too.

* Early init

The early init file is loaded before the =init.el= file.  Is loaded even before the GUI is
initialized.
https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html

** Header

Header of the early init file:

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes
  ;;; early-init.el --- Emacs early init -*- lexical-binding: t -*-

  ;; Copyright (C) 2021 Tommaso Rossi

  ;; Author: Tommaso Rossi <tommaso.rossi1@protonmail.com

  ;; This file is NOT part of GNU Emacs.

  ;;; Commentary:

  ;; Emacs early init file, that gets evaluated before init.el and even before the GUI is loaded.
  ;; The focus is on optimizing startup time and perform basic UI cleanups.

  ;;; Code:
#+end_src

** Garbage collections

Improve startup time by reducing garbage collections at startup.  The classic strategy is to set a high consing threshold during initialization and then restore it to a lower value once init is completed.

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes

  ;;;; Optimize garbage collections

  (defconst tr/gc-cons-standard-threshold-mb 1024
    "Number of MB of consing between garbage collection during normal operativity.")
  (defconst tr/gc-cons-startup-threshold-mb 2048
    "Number of MB of consing between garbage collection during startup.")

  (defun tr/restore-garbage-collection ()
    "Restore GC consing threshold to `tr/gc-cons-standard-threshold-mb'."
    (setq gc-cons-threshold (* tr/gc-cons-standard-threshold-mb 1024 1024)))

  ;; set high garbage collection consing threshold during startup
  (setq gc-cons-threshold (* tr/gc-cons-startup-threshold-mb 1024 1024))

  ;; restore garbage collection after init
  (add-hook 'after-init-hook 'tr/restore-garbage-collection)

#+end_src

Another useful trick is to garbage collect when idle (from https://emacs.stackexchange.com/questions/34342/is-there-any-downside-to-setting-gc-cons-threshold-very-high-and-collecting-ga)

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes
  ;; garbage collect when idle
  (run-with-idle-timer 2 t 'garbage-collect)

#+end_src

** File name handlers at startup

Temporarily disabling file name handlers at startup can speedup startup too.  Source: ambrevar dotfiles https://github.com/Ambrevar/dotfiles/blob/master/.emacs.d/init.el

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes
  ;;;; Temporary disable file handler at startup

  (defvar default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)

  (defun tr/reset-file-name-handler-alist ()
    "Reset filename handlers to default value."
    (setq file-name-handler-alist default-file-name-handler-alist))

  (add-hook 'after-init-hook 'tr/reset-file-name-handler-alist)

#+end_src

** Disable =package.el=

Disable =package.el= at startup as =straight.el= package manager will be used.

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes
  ;;;; Disable package.el at startup

  (setq package-enable-at-startup nil)

#+end_src

** Early UI cleanups

Remove useless stuff from UI and other optimizations

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes
  ;;;; Early UI cleanups

  ;; frame resize seems to be very expensive, disable it
  (setq frame-inhibit-implied-resize t)
  (setq inhibit-default-init t)
  (setq inhibit-startup-buffer-menu t)
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message nil)
  (setq initial-major-mode 'fundamental-mode)

#+end_src

** Move backups elsewhere

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes
  ;;;; Move backups elsewhere

  (setq default-directory "~/")
  (setq backup-directory-alist `(("." . "~/.cache/emacs/var/backup/")))

#+end_src

** Footer

Footer of the early init file:

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el :mkdirp yes
  ;;; early-init.el ends here
#+end_src

* Header

Header of the init file:

#+begin_src emacs-lisp
  ;;; init.el --- Emacs configuration -*- lexical-binding: t -*-

  ;; Copyright (C) 2021 Tommaso Rossi

  ;; Author: Tommaso Rossi <tommaso.rossi1@protonmail.com

  ;; This file is NOT part of GNU Emacs.

  ;;; Commentary:

  ;; GNU Emacs configuration.

  ;; Main features:

  ;; - Optimization of startup times with careful lazy loading.
  ;; - Reproducible builds with =straight.el=.
  ;; - Completion framework including completions at point (`company')
  ;;   and minibuffer completions with incremental narrowing, fuzzy matching
  ;;   of results and frequency-recency based ordering of completion candidates.
  ;; - Enhancements of Emacs terminals, with special attention to =eshell=.
  ;; - Non-intrusive vim-like (`evil') keybindings.  Keybindings in this config
  ;;   are the Emacs defaults, eccept for the ones set by `evil' and `evil-collection'.
  ;;   No further customization is performed for ensuring understandability.
  ;; - Development with LSP mode where feasible.
  ;; - Configuration of some frontends for external applications to ensure an
  ;;   immersive Emacs experience.
  ;; - Optional configuration of =EXWM=, the Emacs window manager for Xorg
  ;;   (see `desktop.el').

  ;;; Code:

#+end_src

* Some early configuration

Display startup time in seconds to better monitoring.

#+begin_src emacs-lisp
  ;;;; Measure init time
  
  (defconst emacs-start-time (current-time))
  
  (add-hook 'after-init-hook
	    `(lambda ()
	       (let ((elapsed
		      (float-time
		       (time-subtract (current-time) emacs-start-time))))
		 (message "Initialized in %.2fs with %d garbage collections" elapsed gcs-done))) t)
  
#+end_src

Disable menus and some mouse-based interface.

#+begin_src emacs-lisp
  ;; disable really ugly stuff
  (menu-bar-mode -1)
  (toggle-scroll-bar -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)

#+end_src

The following is a dirty trick to avoid the annoying startup message:
#+begin_quote
For information about GNU Emacs and the GNU system, type C-h C-a.
#+end_quote
The only way to disable is having your username /hardcoded/ in the =init.el=: Emacs analyzes statically the init file for finding this row:
#+begin_quote
(setq inhibit-startup-echo-area-message "your-username-here")
#+end_quote
So there's no way to do it in Emacs Lisp code, but org mode can help:

#+name: whoami
#+begin_src shell :results output
  # use echo -n for stripping away the newline
  echo -n $(whoami)
#+end_src

#+begin_src emacs-lisp :noweb yes
  (setq inhibit-startup-echo-area-message "<<whoami()>>")
    
#+end_src

Put native compilation warnings in a background buffer.  If native compilation feature is not used,
this =setq= should not bother.

#+begin_src emacs-lisp
  ;; silent native compilation warning
  (setq native-comp-async-report-warnings-errors 'silent)

#+end_src

Start fullscreen.

#+begin_src emacs-lisp
  ;; start fullscreen
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

Add the custom lisp folder to load path.

#+begin_src emacs-lisp
  ;; add lisp folder to load path
  (eval-when-compile
    (add-to-list 'load-path "~/.emacs.d/lisp/"))

#+end_src

* Packaging

This section is dedicated to configuring the package manager (=straight.el=) and the main packaging
helper macro (=use-package=) to pull and configure packages used in this configuration.
This section *should* (eccept for some =:straight= directive in =use-package= forms) the only one to be modified if another package manager is used.

#+begin_src emacs-lisp
  ;;;; packaging

#+end_src

** Bootstrap the package manager

The =straight.el= package manager is preferred to the builtin =package.el= due to its "functional package manager" pattern that ensures reproducible builds and facilitate interacting and modifying packages, as they are pulled as git repositories and not just opaque tarballs.

https://github.com/raxod502/straight.el

#+begin_src emacs-lisp
  ;;;;; Configure `straight.el' as package manager

  ;; bootstrap `straight.el'
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

** Manage lockfile and profiles

Multiple profiles can be managed by =straight.el=, but here just the default one will be used.
To ensure *exact* reproducibility I keep the lockfile checked into source control
(see https://github.com/raxod502/straight.el#lockfile-management).

#+begin_src emacs-lisp
  ;; configure straight lockfile (it can be committed)
  (setq straight-profiles '((nil . "~/.emacs.d/lockfile.el")))

#+end_src

** Initialize =use-package=

=use-package= is a widely used macro that helps keeping the configuration clean.
https://github.com/jwiegley/use-package

#+begin_src emacs-lisp
  ;;;;; Configure `use-package'

  ;; pull use-package
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

  ;; do not break if some :ensure are still in `use-package' forms
  (setq use-package-ensure-function
	(lambda (name &rest _)
	  (message "Ignoring ':ensure t' in '%s' config" name)))

  ;; uncomment for enabling package auditing:
  ;; (setq use-package-verbose t)
  ;; (setq use-package-compute-statistics t)

#+end_src

* Keep folders clean

By default Emacs spams ~ (backups) and # (lock) files everywhere.
More precisely, in the same folder of edited file.  As already stated, this behaviour is not acceptable as it pollutes the filesystem.

For starters, disable lockfiles.
#+begin_src emacs-lisp
  ;;;;; Keep folders clean

  ;; disable pesky lockfiles
  (setq create-lockfiles nil)

#+end_src

Change some backup defaults:

#+begin_src emacs-lisp
  ;; change some backup default
  (setq backup-by-copying t)
  (setq delete-old-versions t)
  (setq kept-new-versions 4)
  (setq kept-old-versions 2)
  (setq version-control t)

#+end_src

Another thing that is annoying if you have a configuration checked into source control is
the custom file: just put it in a temp file (cfr. ambrevar).  *Warning*: this actually disable
=customize= (as wanted).

#+begin_src emacs-lisp
  ;; custom file to temp file (practically disable `customize')
  (setq custom-file
	(if (boundp 'server-socket-dir)
	    (expand-file-name "custom.el" server-socket-dir)
	  (expand-file-name (format "emacs-custom-%s.el" (user-uid))
			    temporary-file-directory)))

#+end_src

* Completion framework

This section is dedicated to configuring a completion framework, entspanning completions at point
and minibuffer completions with incremental narrowing and smart ordering of completion candidates.
Getting help and hints is an important part of a completion framework too.

#+begin_src emacs-lisp
  ;;;; Completion framework

#+end_src

** Getting help and docs

Emacs describes itself as (see the Emacs =info= page):

#+begin_quote
Emacs is the advanced, extensible, customizable, self-documenting editor.
#+end_quote

As we can see, the self-documentation is a very important feature of Emacs, widely used both during
configuration and daily usage.  Some packages can greatly improve the self-documentation and getting help when needed.

#+begin_src emacs-lisp
  ;;;;; Getting help and docs

#+end_src

*** Improve self-documentation

The excellent =helpful= package expands self-documentation, adding useful contextual information
such as source snippets, links, and usages.

https://github.com/Wilfred/helpful

#+begin_src emacs-lisp
  ;; improve self documentation
  (use-package helpful
    :bind
    ([remap describe-function] . helpful-callable)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key)
    ("C-h o" . helpful-symbol)
    ("C-c C-d" . helpful-at-point))

#+end_src

